<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Paths
    |--------------------------------------------------------------------------
    |
    | Rotas que devem permitir CORS.
    |
    */
    'paths' => [
        'api/*',
        'login',
        'logout',
        'sanctum/csrf-cookie',
    ],

    /*
    |--------------------------------------------------------------------------
    | Métodos permitidos
    |--------------------------------------------------------------------------
    */
    'allowed_methods' => ['*'],

    /*
    |--------------------------------------------------------------------------
    | Origens permitidas
    |--------------------------------------------------------------------------
    | Permitimos localhost e qualquer subdomínio do faturaja.sdoca
    */
    'allowed_origins' => [
        'http://localhost:3000',
        'http://faturaja.sdoca',
    ],

    'allowed_origins_patterns' => [
        '/^https?:\/\/.*\.faturaja\.sdoca$/', // qualquer subdomínio
    ],

    /*
    |--------------------------------------------------------------------------
    | Headers permitidos
    |--------------------------------------------------------------------------
    */
    'allowed_headers' => ['*'],

    'exposed_headers' => [],

    'max_age' => 0,

    /*
    |--------------------------------------------------------------------------
    | Credenciais
    |--------------------------------------------------------------------------
    | Necessário para Sanctum (cookies)
    */
    'supports_credentials' => true,
];
